[Regrouper les données d'un tableau Excel par formule Python](https://www.youtube.com/watch?v=t1Zu1TS7_5M&list=PLpQBnWleLAauKmgcdndmEr81iIIoW9_Wi&index=26)

Date : 12/06/2025 <br>
Editeur : Laurent REYNAUD

In [1]:
import pandas as pd

In [3]:
tb = pd.read_excel('data/Pivot.xlsx', sheet_name='Feuil1')
tb.head().transpose()

           0      1         2        3      4
ID         1      2         3        4      5
Nom    Alice    Bob  Antoinne  Etienne  Médhi
Sujet  Maths  Maths     Maths    Maths  Maths
Score     85     90        69       95     85

Regroupage des données

In [5]:
tb.pivot(index=['ID', 'Nom'], columns='Sujet', values='Score').reset_index()

Sujet  ID       Nom  Maths  Programmation  Science
0       1     Alice     85             72       88
1       2       Bob     90             85       92
2       3  Antoinne     69             90       50
3       4   Etienne     95             57       76
4       5     Médhi     85             95       75
5       6   Carinne     53             52       57
6       7    Maëlis     86             62       64
7       8    Khaled     74             88       59
8       9      John     87             84       51
9      10  Charline     69             90       86